//**********************************************************************
//<OEM_FHDR_START>
//
// Name:	PostInfo.uni
//
// Description:	Create UNI file for POST info module.
//
//<OEM_FHDR_END>
//**********************************************************************
/=#
//
// 
//
#include "VFR.uni"

#string STR_POST_INFO_BLANK                #language eng ""
                                           #language zh-chs ""
//<Yaosr001-20190731 Support BIOS HotKey select. +>
#string STR_POST_HOT_KEY_DISABLE_HELP      #language eng "Press F7 to Enter BBS POPUP, Press F12 to Boot From Network\n"
                                           #language zh-chs "按F7键进入BBS弹出菜单，按F12键从网络启动。"
//<Yaosr001-20190731 Support BIOS HotKey select. ->
//SGMTB#163189:Add Cpu Frequency& TDP Info Support+>
#string STR_POST_INFO_CPU                  #language eng "CPU[%d]: \r\n    Version:%s"
                                           #language zh-chs "CPU[%d]: \r\n    Version:%s"
//SGMTB#163189:Add Cpu Frequency& TDP Info Support->
//#string STR_POST_INFO_MEM                  #language eng "Memory Size: %dGB \nFrequency  : %dMT/s" //<Yaosr002-20180721 modify post display information> 
#string STR_POST_INFO_MEM                  #language eng "Total Size: %dGB \nFrequency : %dMT/s\nCount     : %d" //<Yaosr001-20200506 Display Memory manufacturer/count/EccCapbility/Locator during the post.>
                                           #language zh-chs "内存大小: %dGB \n频率  : %dMT/s\n数量  : %d"
#string STR_POST_HOT_KEY_HELP              #language eng "Press F7 to Enter BBS POPUP, Press F12 to Boot From Network\nPress DEL to Enter SETUP"
                                           #language zh-chs "按F7进入BBS弹出菜单，按 F12从网络启动\n按DEL进入Setup"
//#string STR_POST_INFO_USB                  #language eng "Usb Devices Total: %s" //<Yaosr002-20180721 modify post display information>
#string STR_POST_INFO_USB                  #language eng "Total: %s"               //<Yaosr002-20180721 modify post display information>
                                           #language zh-chs "设备总数: %s"
#string STR_POST_INFO_USB_DEV              #language eng "#%02d: %s"
                                           #language zh-chs "#%02d: %s"
//#string STR_POST_INFO_HDD                  #language eng "Detected HDD Device..." //<Yaosr002-20180721 modify post display information>
#string STR_POST_INFO_HDD                  #language eng "HDD Device Information"  //<Yaosr002-20180721 modify post display information>
                                           #language zh-chs "硬盘设备信息"
#string STR_POST_INFO_HDD_DEV              #language eng "HDD%02d: %s"
                                           #language zh-chs "硬盘%02d: %s"
//<Chendl001-20170615 Display Network Card Info +>
//#string STR_POST_INFO_NETWORK              #language eng "Detected Network Device..."//<Yaosr002-20180721 modify post display information>
#string STR_POST_INFO_NETWORK              #language eng "Network Device Information"  //<Yaosr002-20180721 modify post display information>
                                           #language zh-chs "网络设备信息"
#string STR_POST_INFO_ONBOARD_DEV          #language eng "Embedded: %s"
                                           #language zh-chs "板载: %s"
//#string STR_POST_INFO_SLOT_DEV           #language eng "Slot    : %s"    //<YinQiang001-20170923 bios post network devices message>
#string STR_POST_INFO_SLOT_DEV             #language eng "Slot %02d : %s"  //<YinQiang001-20170923 bios post network devices message>
                                           #language zh-chs "插槽 %02d : %s"               
//<Chendl001-20170615 Display Network Card Info ->
//<Yaosr001-20200530 Display BIOS version/BMC version/BMC IP to screen when quiet boot. +>
#string STR_POST_INFO_BIOS_VERSION         #language eng "BIOS Version    : %a"
                                           #language zh-chs "BIOS  版本: %a"
#string STR_POST_INFO_BMC_VERSION          #language eng "BMC Version     : %s"
                                           #language zh-chs "BMC   版本: %s"
#string STR_POST_INFO_BMC_SHARELAN_IP      #language eng "BMC Shared IP   : %s"
                                           #language zh-chs "BMC 共享IP: %s"
#string STR_POST_INFO_BMC_DEDICATEDLAN_IP  #language eng "BMC Dedicated IP: %s"
                                           #language zh-chs "BMC 专用IP: %s"
//<Yaosr001-20200530 Display BIOS version/BMC version/BMC IP to screen when quiet boot. ->

//<Yaosr001-2020623 Support chinese display during the post. +>
#string STR_POST_INFO_CPUTITLE             #language eng "Processor Information"
                                           #language zh-chs "处理器信息"
//SGMTB#163189:Add Cpu Frequency& TDP Info Support+>
#string STR_POST_INFO_CPU_CORENUM          #language eng "    Core Number:  %d\r\n    Cores Frequency:%d.% dGHz\r\n    TDP:%d Watts"
                                           #language zh-chs "    核数: %d\r\n    频率：%d.%d GHz\r\n    TDP:%d Watts"
//SGMTB#163189:Add Cpu Frequency& TDP Info Support->
#string STR_POST_INFO_MEMINFO              #language eng "Meomory Information"
                                           #language zh-chs "内存信息"
#string STR_POST_INFO_USBINFO              #language eng "USB Device Information"
                                           #language zh-chs "USB设备信息"
#string STR_POST_INFO_SYSTEMINFO           #language eng "System Information"
                                           #language zh-chs "系统信息"
#string STR_POST_INFO_MANUFACTURER         #language eng "Manufacturer: %s"
                                           #language zh-chs "制造商: %s"
#string STR_POST_INFO_PRODUCTNAME          #language eng "Product Name: %s"
                                           #language zh-chs "型号  : %s"

#string STR_POST_INFO_BMC_STATUS           #language eng "BMC Status"
                                           #language zh-chs "BMC状态"
#string STR_POST_INFO_PASSED               #language eng "PASSED"
                                           #language zh-chs "正常"
#string STR_POST_INFO_FAILED               #language eng "FAILED"
                                           #language zh-chs "异常"
#string STR_POST_INFO_SELF_TEST            #language eng "Self Test        : %s"
                                           #language zh-chs "自检状态    : %s"
#string STR_POST_INFO_REVISION             #language eng "Revision         : %s"
                                           #language zh-chs "版本        : %s"
#string STR_POST_INFO_BUILD_DATE           #language eng "Build Date       : %s"
                                           #language zh-chs "创建时间    : %s"
#string STR_POST_INFO_BMC_SHARED_LAN       #language eng "BMC Shared LAN   : "
                                           #language zh-chs "BMC共享网络 :"
#string STR_POST_INFO_IP_SOURCE            #language eng "IP Source        : %s"
                                           #language zh-chs "IP源        : %s"
#string STR_POST_INFO_IP_ADDR              #language eng "IP Address       : %s"
                                           #language zh-chs "IP地址      : %s"
#string STR_POST_INFO_SUBNET_MASK          #language eng "Subnet Mask      : %s"
                                           #language zh-chs "子网掩码    : %s"
#string STR_POST_INFO_MAC_ADDR             #language eng "MAC Address      : %s"
                                           #language zh-chs "MAC地址     : %s"
#string STR_POST_INFO_ROUTER_IP            #language eng "Router IP        : %s"
                                           #language zh-chs "路由IP地址  : %s"
#string STR_POST_INFO_BMC_DEDICATE_LAN     #language eng "BMC Dedicated LAN:"
                                           #language zh-chs "BMC专用网络 :"
//<Yaosr001-2020623 Support chinese display during the post. ->

//<Fancf-20200725 Add strings Chinese support. +>
#string STR_IPSOURCE_STATIC_ADDRESS                  #language eng "StaticAddress"
                                                     #language zh-chs "静态地址"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_DHCP        #language eng "DynamicAddressBmcDhcp"
                                                     #language zh-chs "DHCP动态分配"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BIOS_DHCP       #language eng "DynamicAddressBiosDhcp"
                                                     #language zh-chs "动态地址 BiosDhcp"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_NON_DHCP    #language eng "DynamicAddressBmcNonDhcp"
                                                     #language zh-chs "非DHCP动态分配"
//<Fancf-20200725 Add strings Chinese support. ->
//**********************************************************************
